codenocold/dgm/Firmware_boot/GD32C10x_standard_peripheral/Source/gd32c10x_can.c
    can_filter_init(&can_filter);
}

/*!
    \brief      CAN baud rate configure in classic mode
                  Note: this function can use to reconfigure the baud rate of CAN, but when consider the problem of bit time,
                can_init function is more recommend
    \param[in]  can_periph
      \arg        CANx(x=0,1)
    \param[in]  hz: frequency, range from 1 to 1000000 Hz
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus can_frequency_set(uint32_t can_periph, uint32_t hz)
{
    ErrStatus reval = SUCCESS;
    uint32_t reg_temp;
    uint32_t fdctl_status;
    /* The maximum baud rate support to 1M  */
    if(hz <= 1000000U) {
        if(SUCCESS == can_working_mode_set(can_periph, CAN_MODE_INITIALIZE)){
            reg_temp = CAN_BT(can_periph);
            reg_temp &= (CAN_BT_LCMOD | CAN_BT_SCMOD);
            fdctl_status = CAN_FDCTL(can_periph);
            if(CAN_FDCTL_FDEN != (fdctl_status&CAN_FDCTL_FDEN)){
                /* CAN FD disable, should first enable, then write */
                fdctl_status = fdctl_status | CAN_FDCTL_FDEN;
                CAN_FDCTL(can_periph) = fdctl_status;
                CAN_BT(can_periph) = reg_temp | dev_can_baudrate_set(hz);
                fdctl_status = fdctl_status & (~CAN_FDCTL_FDEN);
                CAN_FDCTL(can_periph) = fdctl_status;
            }else{
                /* CAN FD enable */
                CAN_BT(can_periph) = reg_temp | dev_can_baudrate_set(hz);
            }
        }else {
            reval = ERROR;
        }

        if(SUCCESS != can_working_mode_set(can_periph, CAN_MODE_NORMAL)){
            reval = ERROR;
        }
    }else{
        reval = ERROR;
    }

    return reval;
}

/*!
    \brief      CAN baud rate configure in FD mode
                  Note: this function can use to reconfigure the baud rate of CAN FD, but when consider the problem of bit time,
                can_fd_init function is more recommend
    \param[in]  can_periph
      \arg        CANx(x=0,1)
    \param[in]  hz: frequency
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus can_fd_frequency_set(uint32_t can_periph, uint32_t hz)
{
    ErrStatus reval = SUCCESS;

    if(SUCCESS == can_working_mode_set(can_periph, CAN_MODE_INITIALIZE)){
        CAN_DBT(can_periph) = dev_can_fd_baudrate_set(hz);
    }else {
        reval = ERROR;
    }

    if(SUCCESS != can_working_mode_set(can_periph, CAN_MODE_NORMAL)){
        reval = ERROR;
    }

    return reval;
}

/*!
    \brief      CAN communication mode configure
    \param[in]  can_periph
      \arg        CANx(x=0,1)
    \param[in]  mode: communication mode
                only one parameter can be selected which is shown as below:
      \arg        CAN_NORMAL_MODE
      \arg        CAN_LOOPBACK_MODE
      \arg        CAN_SILENT_MODE
      \arg        CAN_SILENT_LOOPBACK_MODE
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus can_monitor_mode_set(uint32_t can_periph, uint8_t mode)
{
    ErrStatus reval = SUCCESS;
    uint32_t timeout = CAN_TIMEOUT;

    if(mode == (mode & CAN_SILENT_LOOPBACK_MODE)){
        /* disable sleep mode */
        CAN_CTL(can_periph) &= (~(uint32_t)CAN_CTL_SLPWMOD);
        /* set initialize mode */
        CAN_CTL(can_periph) |= (uint8_t)CAN_CTL_IWMOD;
        /* wait the acknowledge */
        timeout = CAN_TIMEOUT;
        while((CAN_STAT_IWS != (CAN_STAT(can_periph) & CAN_STAT_IWS)) && (0U != timeout)){
            timeout--;
        }

        if(CAN_STAT_IWS != (CAN_STAT(can_periph) & CAN_STAT_IWS)){
            reval = ERROR;
        }else{
            CAN_BT(can_periph) &= ~BT_MODE(3);
            CAN_BT(can_periph) |= BT_MODE(mode);

            timeout = CAN_TIMEOUT;
            /* enter normal mode */
            CAN_CTL(can_periph) &= ~(uint32_t)(CAN_CTL_SLPWMOD | CAN_CTL_IWMOD);
            /* wait the acknowledge */
            while((0U != (CAN_STAT(can_periph) & (CAN_STAT_IWS | CAN_STAT_SLPWS))) && (0U != timeout)){
                timeout--;
            }
            if(0U != (CAN_STAT(can_periph) & (CAN_STAT_IWS | CAN_STAT_SLPWS))){
                reval = ERROR;
            }
        }
    }else{
        reval = ERROR;
    }

    return reval;
}

/*!
    \brief      CAN FD frame function enable
    \param[in]  can_periph
    \arg        CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_fd_function_enable(uint32_t can_periph)
{
    CAN_FDCTL(can_periph) |= CAN_FDCTL_FDEN;
}

/*!
    \brief      CAN FD frame function disable
    \param[in]  can_periph
    \arg        CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_fd_function_disable(uint32_t can_periph)
{
    CAN_FDCTL(can_periph) &= ~CAN_FDCTL_FDEN;
}

/*!
    \brief      set CAN1 filter start bank number
    \param[in]  start_bank: CAN1 start bank number
                only one parameter can be selected which is shown as below:
      \arg        (1..27)
    \param[out] none
    \retval     none
*/
void can1_filter_start_bank(uint8_t start_bank)
{
    /* filter lock disable */
    CAN_FCTL(CAN0) |= CAN_FCTL_FLD;
    /* set CAN1 filter start number */
    CAN_FCTL(CAN0) &= ~(uint32_t)CAN_FCTL_HBC1F;
    CAN_FCTL(CAN0) |= FCTL_HBC1F(start_bank);
    /* filter lock enable */
    CAN_FCTL(CAN0) &= ~CAN_FCTL_FLD;
}

/*!
    \brief      enable CAN debug freeze
    \param[in]  can_periph
      \arg        CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_debug_freeze_enable(uint32_t can_periph)
{
    /* set DFZ bit */
    CAN_CTL(can_periph) |= CAN_CTL_DFZ;
    if(CAN0 == can_periph){
        dbg_periph_enable(DBG_CAN0_HOLD);
    }else{
        dbg_periph_enable(DBG_CAN1_HOLD);
    }
}

/*!
    \brief      disable CAN debug freeze
    \param[in]  can_periph
      \arg        CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_debug_freeze_disable(uint32_t can_periph)
{
    /* set DFZ bit */
    CAN_CTL(can_periph) &= ~CAN_CTL_DFZ;

    if(CAN0 == can_periph){
        dbg_periph_disable(DBG_CAN0_HOLD);
    }else{
        dbg_periph_disable(DBG_CAN1_HOLD);
    }
}

/*!
    \brief      enable CAN time trigger mode
    \param[in]  can_periph
      \arg        CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_time_trigger_mode_enable(uint32_t can_periph)
{
    uint8_t mailbox_number;

    /* enable the tcc mode */
    CAN_CTL(can_periph) |= CAN_CTL_TTC;
    /* enable time stamp */
    for(mailbox_number = 0U; mailbox_number < 3U; mailbox_number++){
        CAN_TMP(can_periph, mailbox_number) |= CAN_TMP_TSEN;
    }
}

/*!
    \brief      disable CAN time trigger mode
    \param[in]  can_periph
      \arg        CANx(x=0,1)
    \param[out] none
    \retval     none
*/
void can_time_trigger_mode_disable(uint32_t can_periph)
{
    uint8_t mailbox_number;

