codenocold/dgm/Firmware_boot/GD32C10x_standard_peripheral/Source/gd32c10x_can.c
    /* BS1 is 5 times of BS2 */
    bs_div_value = brate_data.bits / 5;
    reval = (BT_BS1(brate_data.bits-bs_div_value))
          | (BT_BS2(bs_div_value))
          | ((0U                  << 24) & DEV_CAN_SJW_MASK)
          | ((brate_data.baud_psc)       & DEV_CAN_BAUDPSC_MASK);

    return reval;
}

/*!
    \brief      auto config can fd baud rate by frequency
    \param[in]  freq: the frequency of the baud rate
    \param[out] none
    \retval     CAN_BT register set value
*/
static unsigned int dev_can_fd_baudrate_set(uint32_t freq)
{
    uint32_t reval;
    uint32_t baud_psc;
    uint32_t baud_psc_max;
    uint32_t temp;
    uint32_t bt_reg_config;
    uint8_t flag;
    uint32_t bits = 0;

    struct brate_data_str{
        uint32_t bits;
        uint32_t baud_psc;
        uint32_t min_num;
    };

    struct brate_data_str brate_data = {0, 0, 0xFFFFFFFF};

    flag = 0U;
    /* computes the value that the CAN_BT register needs to be configured */
    /* (BAUDPSC[9:0] + 1) * ((BS1[3:0] + 1) + (BS2[2:0] + 1) + SJW(always 1)) */
    bt_reg_config = (rcu_clock_freq_get(CK_APB1) / freq);
    /* BAUDPSC[9:0] minimum value */
    baud_psc = bt_reg_config / DEV_CAN_FD_BT_SEG_MAX;
    /* BAUDPSC[9:0] maximum value */
    baud_psc_max = bt_reg_config / DEV_CAN_FD_BT_SEG_MIN;

    while((!flag) && (baud_psc < baud_psc_max)){
        for(bits=0u; bits<=DEV_CAN_FD_BT_SEG_MAX; bits++){
            temp = (bits + 3U) * (baud_psc + 1U);

            /* get the combination of smallest difference */
            if(temp == bt_reg_config){
                flag = 1U;
                break;
            }else{
                /* calculation the difference */
                if(temp>bt_reg_config){
                    temp = temp - bt_reg_config;
                }else{
                    temp = bt_reg_config - temp;
                }
                /* set the combination with small difference */
                if(temp<brate_data.min_num){
                        brate_data.baud_psc = baud_psc;
                        brate_data.bits = bits;
                        brate_data.min_num = temp;
                    }
            }
        }
        if(flag){
            break;
        }
        baud_psc++;
    }

    /* set the combination value */
    if(flag){
        reval = ((timing_pts[bits][1] << 20) & DEV_CAN_FD_BS2_MASK)
              | ((timing_pts[bits][0] << 16) & DEV_CAN_FD_BS1_MASK)
              | ((0U                  << 24) & DEV_CAN_FD_SJW_MASK)
              | ((baud_psc)                  & DEV_CAN_BAUDPSC_MASK);
    }else{
        reval = ((timing_pts[brate_data.bits][1] << 20) & DEV_CAN_FD_BS2_MASK)
              | ((timing_pts[brate_data.bits][0] << 16) & DEV_CAN_FD_BS1_MASK)
              | ((0U                             << 24) & DEV_CAN_FD_SJW_MASK)
              | ((brate_data.baud_psc)                  & DEV_CAN_BAUDPSC_MASK);
    }

    return reval;
}
